{
  "class_name": "Sequential",
  "keras_version": "2.0.8",
  "config": [
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "RandomNormal",
          "config": {
            "seed": null,
            "stddev": 0.05,
            "mean": 0.0
          }
        },
        "name": "dense_1",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "linear",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 9,
        "batch_input_shape": [
          null,
          9
        ],
        "use_bias": false,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_constraint": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "batch_normalization_1",
        "epsilon": 0.001,
        "trainable": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "scale": true,
        "axis": -1,
        "gamma_constraint": null,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "momentum": 0.99,
        "center": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "RandomNormal",
          "config": {
            "seed": null,
            "stddev": 0.05,
            "mean": 0.0
          }
        },
        "name": "dense_2",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "linear",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 128,
        "use_bias": false,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_constraint": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "batch_normalization_2",
        "epsilon": 0.001,
        "trainable": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "scale": true,
        "axis": -1,
        "gamma_constraint": null,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "momentum": 0.99,
        "center": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_2"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "RandomNormal",
          "config": {
            "seed": null,
            "stddev": 0.05,
            "mean": 0.0
          }
        },
        "name": "dense_3",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "linear",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 64,
        "use_bias": false,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_constraint": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "batch_normalization_3",
        "epsilon": 0.001,
        "trainable": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "scale": true,
        "axis": -1,
        "gamma_constraint": null,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "momentum": 0.99,
        "center": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "relu",
        "trainable": true,
        "name": "activation_3"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "RandomNormal",
          "config": {
            "seed": null,
            "stddev": 0.05,
            "mean": 0.0
          }
        },
        "name": "dense_4",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "linear",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 1,
        "use_bias": false,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "beta_constraint": null,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "name": "batch_normalization_4",
        "epsilon": 0.001,
        "trainable": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "scale": true,
        "axis": -1,
        "gamma_constraint": null,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "momentum": 0.99,
        "center": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "sigmoid",
        "trainable": true,
        "name": "activation_4"
      }
    }
  ],
  "backend": "tensorflow"
}